Documents/РасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасходДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИМатериалов</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ПоступлениеУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВыдыОперацийРасходаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасходДенежныхСредств/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

Движение = Движения.ДенежныеСредства.ДобавитьРасход();  
Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
Движение.БанковскийСчетКасса = Касса;
Движение.Сумма = СуммаДокумента;  
Движение.Период = Дата;


Движения.ДенежныеСредства.Записывать = Истина;
Движения.ДенежныеСредства.БлокироватьДляИзменения = Истина; 

АналитикаПроводки = ПолучитьАналитикуПроводки();
Движения.Хозрасчетный.Записывать = Истина;
Движение = Движения.Хозрасчетный.Добавить();
Движение.Период = Дата;
Движение.СчетДт = АналитикаПроводки.СчетДебета;
Движение.СчетКт = АналитикаПроводки.СчетКредита;
Движение.Сумма = СуммаДокумента;
Движение.Содержание = АналитикаПроводки.Содержание; 
БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, АналитикаПроводки.СубконтоДебета);
БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, АналитикаПроводки.СубконтоКредита);



Движения.Записать();

Запрос = Новый Запрос;
Запрос.УстановитьПараметр("Касса", Касса);
Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
Запрос.Текст=
"ВЫБРАТЬ
|    ДенежныеСредстваОстатки.БанковскийСчетКасса.Представление КАК Касса,
|    -ДенежныеСредстваОстатки.СуммаОстаток КАК Сумма
|ИЗ
|    РегистрНакопления.ДенежныеСредства.Остатки(
|            &МоментВремени,
|            БанковскийСчетКасса = &Касса
|                И ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)) КАК ДенежныеСредстваОстатки
|ГДЕ
|    ДенежныеСредстваОстатки.СуммаОстаток < 0";

Рез = Запрос.Выполнить();
Если НЕ Рез.Пустой() Тогда
    Отказ = Истина;
    Выборка = Рез.Выбрать();
    Выборка.Следующий();
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = СтрШаблон("По кассе ""%1"" недостаточно денежных средств для расхода в размере %2", Выборка.Касса, Выборка.Сумма);
    Сообщение.Сообщить();
КонецЕсли;
КонецПроцедуры
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИМатериалов") Тогда
			ДоговорКонтрагента = ДанныеЗаполнения.Договор;			
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
			ВидОперации = Перечисления.ВыдыОперацийРасходаДенег.ОплатаПоставщику;
			Получатель = ДанныеЗаполнения.Поставщик;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		  	ДокументОснование = ДанныеЗаполнения.Ссылка;
			СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
			ВидОперации = Перечисления.ВыдыОперацийРасходаДенег.ВозвратДенегПокупателю;
			Получатель = ДанныеЗаполнения.Клиент;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеУслуг") Тогда
			ДоговорКонтрагента = ДанныеЗаполнения.ДоговорПоставщика;			
			ДокументОснование = ДанныеЗаполнения.Ссылка;
			СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
			ВидОперации = Перечисления.ВыдыОперацийРасходаДенег.ОплатаПоставщику;
			Получатель = ДанныеЗаполнения.Поставщик;
		КонецЕсли;
КонецПроцедуры
Функция ПолучитьАналитикуПроводки()
	ВзносНаличнымиВБанк = Перечисления.ВыдыОперацийРасходаДенег.ВзносНаличнымиВБанк;
	ОплатаПоставщику = Перечисления.ВыдыОперацийРасходаДенег.ОплатаПоставщику;
	ВозвратДенегПокупателю = Перечисления.ВыдыОперацийРасходаДенег.ВозвратДенегПокупателю;
	ВыдачаДенегПодотчетнику = Перечисления.ВыдыОперацийРасходаДенег.ВыдачаДенегПодотчетнику;
	ПередачаВДругуюКассу = Перечисления.ВыдыОперацийРасходаДенег.ПередачаВДругуюКассу;
	
	СтруктураАналитики = Новый Структура;
	СтруктураАналитики.Вставить("СчетКредита", Планысчетов.Хозрасчетный.Касса);
	СтруктураАналитики.Вставить("СубконтоКредита",Касса);
	
	Если ВидОперации = ОплатаПоставщику Тогда  
		СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
		СтруктураАналитики.Вставить("СубконтоДебета",Получатель);
		СтруктураАналитики.Вставить("Содержание", "Оплата поставщику наличными из кассы");
	ИначеЕсли ВидОперации = ВозвратДенегПокупателю Тогда
		СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
		СтруктураАналитики.Вставить("СубконтоДебета", Получатель);
		СтруктураАналитики.Вставить("Содержание", "Возврат покупателю наличными их кассы");
	ИначеЕсли ВидОперации = ВыдачаДенегПодотчетнику Тогда
		СтруктураАналитики.Вставить("СчетДебета",ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
	    СтруктураАналитики.Вставить("СубконтоДебета", Получатель);
		СтруктураАналитики.Вставить("Содержание", "Выдача денежных средств подотчетному лицу");
	ИначеЕсли ВидОперации = ВзносНаличнымиВБанк Тогда
		СтруктураАналитики.Вставить("СчетДебета",Планысчетов.Хозрасчетный.РасчетныйСчет);
		СтруктураАналитики.Вставить("СубконтоДебета",Расчетныйсчет);
		СтруктураАналитики.Вставить("Содержание",Расчетныйсчет);
	ИначеЕсли ВидОперации = ПередачаВДругуюКассу Тогда
		СтруктураАналитики.Вставить("СчетДебета",ПланыСчетов.Хозрасчетный.Касса);
		СтруктураАналитики.Вставить("СубконтоДебета",КассаПолучатель);
		СтруктураАналитики.Вставить("Содержание","Передача денежных средств в другую кассу");
	КонецЕсли;
	Возврат СтруктураАналитики;
КонецФункции
